---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.ForegroundPatternColorParam
source: html/9c5df2a6-416a-a238-8a2b-f786cb02ec8a.htm
---
# Autodesk.Revit.DB.ParameterTypeId.ForegroundPatternColorParam Property

"Foreground Pattern Color"

## Syntax (C#)
```csharp
public static ForgeTypeId ForegroundPatternColorParam { get; }
```